{
  "published": true,
  "date": "2020-02-17T00:00:00.000Z",
  "title": "How to use feature branches in Git and GitHub",
  "slug": "feature-branches",
  "description": "Git feature branches are a workflow that involves creating separate branches for each feature you want to build, and merging them back to master. This guide shows you the commands to create a feature branch, merge it to master, and then delete the branch both locally and on the remote Git host. ",
  "body": "Git feature branches are a workflow that involves creating separate branches for each feature you want to build. When a feature is finished, it gets merged into the central `master` branch. \n\nThis enables multiple features to be built in parallel on different branches, without overlapping over each other. \n\nIt also allows you to maintain a stable `master` branch in case the feature gets thrown away or starts to ruin everything. \n\n## Creating the branch\n\nFirst make sure you're on the `master` branch (if not, run `git checkout master` to switch to it). \n\nThen, create a new branch from `master` and switch onto it (replace `<feature_branch>`with the name you choose for your feature branch). \n\n```bash\ngit checkout -b <feature_branch>\n```\n\nFrom here, you can do all your work as you would usually. Commit and push new changes for the feature to this new branch. \n\n## Merging the branch to master\n\nOnce you're done with the your work on the branch and want to merge it into `master`, run these four commands: \n\n```bash\ngit checkout master\ngit pull origin master\ngit merge <feature_branch_name>\ngit push origin master\n```\n\n1. Switch to the `master` branch\n2. Make sure you have the most up-to-date changes from `master`\n3. Merge your feature branch (replace `<feature_branch>` with your branch's name)\n4. Push the changes to the remote host (for example, GitHub)\n\n## Cleaning up\n\nAfterwards, you'll probably want to delete the feature branch. These two commands first delete the branch on the remote host, then delete the branch locally. \n\n```bash\ngit push -d origin <feature_branch>\ngit branch -d <feature_branch>\n```"
}