{
  "published": true,
  "date": "2020-01-09T00:00:00.000Z",
  "title": "How to get a Google Sheet as JSON",
  "slug": "google-sheets-json",
  "description": "There's an obscure way of getting an API for reading a Google Sheet, that doesn't require authentication or complicated permissions. All you need to do is publish the spreadsheet, and use this immediately-updating endpoint to read the contents of the spreadsheet.",
  "body": "Google Sheets can be a great place to store content for a website, since it's structured and easy to update (especially for non-coders).\n\nThere's a very useful but obscure way of getting an API for reading a Google Sheet, that doesn't require authentication or complicated permissions. Plus, it updates immediately when the spreadsheet is edited, without delay!\n\n1. To start, open the Google Sheet and go to **File → Publish to the web**. Publish the entire document, so that it can be accessed without logging in.\n2. Copy and paste the *spreadsheet key*, which is the long random string in the URL of the spreadsheet. Make sure to copy the entire random part of the URL between two slashes.\n3. Then, use the URL endpoint below to get the spreadsheet's contents, replacing \"`spreadsheet_key`\" with your spreadsheet key from the last step:\n\n```\nhttps://spreadsheets.google.com/feeds/list/spreadsheet_key/1/public/values?alt=json\n```\n\nThat's it! If you go to that URL in your browser (substituting your spreadsheet key in the URL), you'll see JSON that contains the contents of your spreadsheet.\n\n# Optional step: formatting the data\n\nI always reformat the data from this API before I use it, since I think the way it's returned by default isn't very usable.\n\nHere's some example code I use to format the data, using the [fetch](https://developer.mozilla.org/en-US/docs/Web/API/Fetch_API) method in JavaScript:\n\n```jsx\nfetch(\"https://spreadsheets.google.com/feeds/list/1wQ1TGqnCTmaqqDak1rTRxPMSGSGLMilwrecf7TuqDGc/1/public/values?alt=json\")\n  .then(res => res.json())\n  .then(json => {\n    const data = [] /* this array will eventually be populated with the contents of the spreadsheet's rows */\n\n    const rows = json.feed.entry\n\n    for(const row of rows) {\n      const formattedRow = {}\n\n      for(const key in row) {\n        if(key.startsWith(\"gsx$\")) {\n\n          /* The actual row names from your spreadsheet \n           * are formatted like \"gsx$title\".\n           * Therefore, we need to find keys in this object\n           * that start with \"gsx$\", and then strip that\n           * out to get the actual row name\n           */\n\n          formattedRow[key.replace(\"gsx$\", \"\")] = row[key].$t\n          \n        }\n      }\n\n      data.push(formattedRow)\n    }\n\n    console.log(data) /* do anything you want with the reformatted data here */\n  })\n```\n\nThe above code will produce a `data` array that looks like this:\n\n```json\n[\n  {\n    image: \"1\",\n    resource: \"\",\n    section: \"math\",\n    test: \"1874FPRE\",\n    firstanswer: \"a\",\n    totalanswers: \"5\",\n    correctanswer: \"c\"\n  },\n  {\n    image: \"2\",\n    resource: \"\",\n    section: \"math\",\n    test: \"1874FPRE\",\n    firstanswer: \"f\",\n    totalanswers: \"5\",\n    correctanswer: \"k\"\n  }\n  ...\n]\n```\n\nOf course, it's up to you how you parse and use the spreadsheet data for your app.\n\n## Bonus: reading the other sheets in your spreadsheet\n\nIn Google Sheets, you can add multiple \"sheets\", which are like multiple pages. If you'd like to read the contents of the second sheet of your spreadsheet, replace the `1` in the URL with `2` (or whatever number sheet you'd like to read):\n\n```\nhttps://spreadsheets.google.com/feeds/list/spreadsheet_key/2/public/values?alt=json\n```"
}