{
  "published": true,
  "date": "2020-05-08T00:00:00.000Z",
  "slug": "js-hash-passwords",
  "title": "How to hash passwords in Node.js",
  "description": "Hashing passwords before saving them to the database is extremely important for security. The most popular library for hashing passwords in Node.js is bcrypt, which supports async/await syntax too. ",
  "body": "Hashing passwords before saving them to the database is extremely important for security. \n\nA *hash* is an algorithm that scrambles up a password in a way that cannot be reversed, but happens the same way each time. \n\nWhen a user signs up, you should take their password, hash it, and then store the resulting \"hash\". This means that you never store their actual password in plain text. Later, if you need to check whether the password they provided is correct, you can hash what they send you and compare the outcome with what you saved. If the two hashes are the same, the user provided the same password both times. \n\nThe most popular library for hashing passwords in Node.js is [`bcrypt`](https://www.npmjs.com/package/bcrypt). First install the package: \n\n```bash\nnpm install bcrypt\n```\n\nand then include it in Node.js so you can use it: \n\n```javascript\nconst bcrypt = require(\"bcrypt\")\n```\n\nWhen you first receive the password and want to store it in the database: \n\n```javascript\nconst SALT_ROUNDS = 10\n// \"Salt rounds\" controls how long it takes to hash a password.\n// Increasing this by 1 doubles the time it takes to hash a password.\n// Higher number means more security, but it'll be slower. \n\nconst hashedPassword = await bcrypt.hash(realPassword, SALT_ROUNDS)\n// Store hashedPassword in your database\n// Never store realPassword in case your database gets exposed\n```\n\nWhen checking whether the password you received is the correct one, using the `bcrypt.compare` method: \n\n```javascript\n/*\n * providedPassword is what the user claims is their password\n * for example through a login form\n * \n * Retrieve hashedPassword from database. \n */\nconst passwordIsCorrect = await bcrypt.compare(providedPassword, hashedPassword)\n// Returns true if they match, false if they don't\n```"
}